{
    "ok": true,
    "result": {
        "lesson_row": {
            "id": 201,
            "user_id": 1,
            "title": "Surah Yusuf 12:1–7 — Opening",
            "title_ar": "سورة يوسف ١٢:١",
            "lesson_type": "quran",
            "subtype": "narrative",
            "status": "draft",
            "difficulty": 3,
            "source": "quran",
            "container_id": "C:QURAN",
            "unit_id": "U:QURAN:12:1-7",
            "created_at": "2026-02-01 11:29:33",
            "updated_at": "2026-02-01 11:29:33"
        },
        "container": {
            "id": "C:QURAN",
            "container_type": "quran",
            "container_key": "quran",
            "title": "Qur’an canonical text",
            "meta_json": "{   \"language\": \"ar\",   \"script\": \"arabic\",    \"text_type\": \"canonical\",   \"canonical\": true,   \"editable\": false,    \"diacritics\": \"uthmani\",   \"orthography\": \"mushaf\",    \"unit_types\": [\"surah\", \"ayah\"],    \"translation_policy\": \"external\",   \"translation_editable\": false,    \"analysis_policy\": {     \"allow_sentences\": true,     \"allow_tokens\": true,     \"allow_spans\": true,     \"allow_analysis_units\": true   } }"
        },
        "units": [
            {
                "id": "U:QURAN:12:1-7",
                "unit_type": "passage",
                "order_index": 0,
                "ayah_from": 1,
                "ayah_to": 7,
                "start_ref": "12:1",
                "end_ref": "12:7",
                "text_cache": "الر تلك آيات الكتاب المبين ‎﴿١﴾‏ إنا أنزلناه قرآنا عربيا لعلكم تعقلون ‎﴿٢﴾‏ نحن نقص عليك أحسن القصص بما أوحينا إليك هذا القرآن وإن كنت من قبله لمن الغافلين ‎﴿٣﴾‏ إذ قال يوسف لأبيه يا أبت إني رأيت أحد عشر كوكبا والشمس والقمر رأيتهم لي ساجدين ‎﴿٤قال يا بني لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا إن الشيطان للإنسان عدو مبين ‎﴿٥﴾‏ وكذلك يجتبيك ربك ويعلمك من تأويل الأحاديث ويتم نعمته عليك وعلى آل يعقوب كما أتمها على أبويك من قبل إبراهيم وإسحاق إن ربك عليم حكيم ‎﴿٦﴾‏ لقد كان في يوسف وإخوته آيات للسائلين ‎﴿٧﴾‏",
                "meta_json": {
                    "label": "Surah Yusuf 12:1-7"
                }
            },
            {
                "id": "U:QURAN:12:1",
                "unit_type": "ayah",
                "order_index": 1,
                "ayah_from": 1,
                "ayah_to": 1,
                "start_ref": "12:1",
                "end_ref": "12:1",
                "text_cache": null,
                "meta_json": {
                    "label": "Surah Yusuf 12:1"
                }
            },
            {
                "id": "U:QURAN:12:2",
                "unit_type": "ayah",
                "order_index": 2,
                "ayah_from": 2,
                "ayah_to": 2,
                "start_ref": "12:2",
                "end_ref": "12:2",
                "text_cache": null,
                "meta_json": {
                    "label": "Surah Yusuf 12:2"
                }
            },
            {
                "id": "U:QURAN:12:3",
                "unit_type": "ayah",
                "order_index": 3,
                "ayah_from": 3,
                "ayah_to": 3,
                "start_ref": "12:3",
                "end_ref": "12:3",
                "text_cache": null,
                "meta_json": {
                    "label": "Surah Yusuf 12:3"
                }
            },
            {
                "id": "U:QURAN:12:4",
                "unit_type": "ayah",
                "order_index": 4,
                "ayah_from": 4,
                "ayah_to": 4,
                "start_ref": "12:4",
                "end_ref": "12:4",
                "text_cache": null,
                "meta_json": {
                    "label": "Surah Yusuf 12:4"
                }
            },
            {
                "id": "U:QURAN:12:5",
                "unit_type": "ayah",
                "order_index": 5,
                "ayah_from": 5,
                "ayah_to": 5,
                "start_ref": "12:5",
                "end_ref": "12:5",
                "text_cache": null,
                "meta_json": {
                    "label": "Surah Yusuf 12:5"
                }
            },
            {
                "id": "U:QURAN:12:6",
                "unit_type": "ayah",
                "order_index": 6,
                "ayah_from": 6,
                "ayah_to": 6,
                "start_ref": "12:6",
                "end_ref": "12:6",
                "text_cache": null,
                "meta_json": {
                    "label": "Surah Yusuf 12:6"
                }
            },
            {
                "id": "U:QURAN:12:7",
                "unit_type": "ayah",
                "order_index": 7,
                "ayah_from": 7,
                "ayah_to": 7,
                "start_ref": "12:7",
                "end_ref": "12:7",
                "text_cache": null,
                "meta_json": {
                    "label": "Surah Yusuf 12:7"
                }
            }
        ],
        "ayat": [
            {
                "unit_id": "U:QURAN:12:1-7",
                "unit_type": "ayah",
                "arabic": "بسم الله الرحمن الرحيم الر تلك آيات الكتاب المبين",
                "arabic_diacritics": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ ١",
                "arabic_non_diacritics": "بسم الله الرحمن الرحيم الر تلك آيات الكتاب المبين",
                "translation": "\"Alif Lam Ra These are the verses of the Scripture that makes things clear––\"",
                "translations": {
                    "haleem": "\"Alif Lam Ra These are the verses of the Scripture that makes things clear––\"",
                    "asad": "Alif. Lam. Ra. THESE ARE MESSAGES of a revelation clear in itself and clearly showing the truth:",
                    "sahih": "\"Alif, Lām, Rā.<sup foot_note=\\\"226972\\\">1</sup> These are the verses of the clear Book.\"",
                    "usmani": "\"یہ آیتیں ہیں واضح کتاب کی<sup foot_note=\\\"83908\\\">1</sup>\"",
                    "footnotes_sahih": "{\"226972\":\"- See footnote to 2:1.\"}",
                    "footnotes_usmani": "{\"83908\":\"جس کا من عنداللہ ہونا بالکل واضح ہے اور جن احکام و شرائع یا مواعظ و نصائح پر وہ مشتمل ہے نہایت روشن اور صاف ہیں۔\"}"
                },
                "surah": 12,
                "ayah": 1,
                "notes": "Surah Yusuf 12:1-7"
            },
            {
                "unit_id": "U:QURAN:12:1-7",
                "unit_type": "ayah",
                "arabic": "إنا أنزلناه قرآنا عربيا لعلكم تعقلون",
                "arabic_diacritics": "إِنَّآ أَنزَلۡنَٰهُ قُرۡءَٰنًا عَرَبِيّٗا لَّعَلَّكُمۡ تَعۡقِلُونَ ٢",
                "arabic_non_diacritics": "إنا أنزلناه قرآنا عربيا لعلكم تعقلون",
                "translation": "\"We have sent it down as an Arabic Quran so that you [people] may understand.\"",
                "translations": {
                    "haleem": "\"We have sent it down as an Arabic Quran so that you [people] may understand.\"",
                    "asad": "behold, We have bestowed it from on high as a discourse in the Arabic tongue, so that you might encompass it with your reason.",
                    "sahih": "\"Indeed, We have sent it down as an Arabic Qur’ān<sup foot_note=\\\"226973\\\">1</sup> that you might understand.\"",
                    "usmani": "\"ہم نے اس کو اتارا ہے قرآن عربی زبان کا تاکہ تم سمجھ لو<sup foot_note=\\\"83909\\\">1</sup>\"",
                    "footnotes_sahih": "{\"226973\":\"- i.e., revealed in the Arabic language.\"}",
                    "footnotes_usmani": "{\"83909\":\"<strong class=h>عربی میں قرآن کے نزول کی حکمت:</strong>یعنی عربی زبان جو تمام زبانوں میں زیادہ فصیح و وسیع اور منضبط و پر شوکت زبان ہے ، نزول قرآن کے لئے منتخب کی گئ۔ جب خود پیغمبر عربی ہیں تو ظاہر ہے کہ دنیا میں اس کے اولین مخاطب عرب ہوں گے ۔ پھر عرب کے ذریعہ سے چاروں طرف یہ روشنی پھیلے گی۔ اسی کی طرف<span class=indopak> لَّعَلَّکُمۡ تَعۡقِلُوۡنَ </span>میں اشارہ فرمایا کہ تمہاری زبان میں اتارنے کی ایک وجہ یہ ہے کہ تم جو پیغمبرؑ کی قوم ہو اول اس کے علوم و معارف کا مزہ چکھو پھر دوسروں کو چکھاؤ۔ چنانچہ ایسا ہی ہوا۔ ابن کثیر لکھتے ہیں۔<span class=indopak> اُنْزِلَ اَشْرَفُ الْکُتُبِ بِاَشْرَفِ اللُغَاتِ عَلٰی اَشْرَفِ الرُّسُلِ بِسِفَارَۃِ اَشْرَفِ الْمَلَائِکَۃِ وَکَانَ ذٰلِکَ فِی اَشْرَفِ بَقَاعِ الْاَرْضِ وَاِبْتَدَاءُ اِنزالِہِ فِی اَشْرَفِ شھُوْرِ السَّنَۃِ وَھُوَ رَمْضَانُ۔ فَکمُلَ مِنْ کُلِّ الوُجُوْہِ </span>۔\"}"
                },
                "surah": 12,
                "ayah": 2,
                "notes": "Surah Yusuf 12:1-7"
            },
            {
                "unit_id": "U:QURAN:12:1-7",
                "unit_type": "ayah",
                "arabic": "نحن نقص عليك أحسن القصص بما أوحينا إليك هذا القرآن وإن كنت من قبله لمن الغافلين",
                "arabic_diacritics": "نَحۡنُ نَقُصُّ عَلَيۡكَ أَحۡسَنَ ٱلۡقَصَصِ بِمَآ أَوۡحَيۡنَآ إِلَيۡكَ هَٰذَا ٱلۡقُرۡءَانَ وَإِن كُنتَ مِن قَبۡلِهِۦ لَمِنَ ٱلۡغَٰفِلِينَ ٣",
                "arabic_non_diacritics": "نحن نقص عليك أحسن القصص بما أوحينا إليك هذا القرآن وإن كنت من قبله لمن الغافلين",
                "translation": "\"We tell you [Prophet] the best of stories in revealing this Quran to you. Before this you were one of those who knew nothing about them.\"",
                "translations": {
                    "haleem": "\"We tell you [Prophet] the best of stories in revealing this Quran to you. Before this you were one of those who knew nothing about them.\"",
                    "asad": "In the measure that We reveal this Qur'an unto thee, [O Prophet,] We explain it to thee in the best possible way, seeing that ere this thou wert indeed among those who are unaware [of what revelation is].",
                    "sahih": "\"We relate to you, [O Muḥammad], the best of stories in what We have revealed to you of this Qur’ān although you were, before it, among the unaware.\"",
                    "usmani": "\"ہم بیان کرتے ہیں تیرے پاس بہت اچھا بیان اس واسطے کہ بھیجا ہم نے تیری طرف یہ قرآن اور تو تھا اس سے پہلے البتہ بیخبروں میں<sup foot_note=\\\"83910\\\">1</sup>\"",
                    "footnotes_sahih": "{}",
                    "footnotes_usmani": "{\"83910\":\"<strong class=h>احسن القصص کی وجہ نزول:</strong>یعنی اس وحی کے ذریعہ سے جو قرآن کی صورت میں تم پر نازل ہوتی ہے۔ ہم ایک نہایت اچھا بیان نہایت حسین طرز میں تم کو سناتے ہیں۔ جس سے اب تک اپنی قوم کی طرح تم بھی بے خبر تھے ۔ گو یہ واقع کتب تاریخ اور بائیبل میں پہلے سے مذکور تھا مگر محض ایک افسانہ کی صورت میں تھا۔ قرآن کریم نے اس کے ضروری اور مفید اجزاء کو ایسی عجیب ترتیب اور بلیغ و موثر انداز میں بیان فرمایا جس نے نہ صرف پہلے تذکرہ نویسوں کی کوتاہیوں پر مطلع کیا بلکہ موقع بہ موقع نہات ہی اعلیٰ نتائج کی طرف رہنمائی کی اور قصہ کے ضمن میں علوم و ہدایات کے ابواب مفتوح کر دئے۔ یہ بات کہ خداوند قدوس کی تقدیر کو کوئی چیز نہیں روک سکتی ، اور خدا جب کسی پر فضل کرنا چاہے تو سارا جہان مل کر بھی اپنی ساری امکانی تدابیر سے اسے محروم نہیں کر سکتا، صبر و اسقامت دنیوی و اخری کامیابی کی کلید ہے ، حسد و عداوت کا انجام خذلان و نقصان کے سوا کچھ نہیں ، عقل انسانی بڑا شریف جوہر ہے جس کی بدولت آدمی بہت سی مشکلات پر غالب آتا اور اپنی زندگی کو کامیاب بنا لیتا ہے ۔ اخلاقی شرافت اور پاکدامنی انسان کو دشمنوں اور حاسدوں کی نظر میں بھی آخر کار معزز بنا دیتی ہے۔ یہ اور اس قسم کے بے شمار حقائق ہیں جن پر اس احسن القصص کے ضمن میں متنبہ فرمایا ہے ۔ مفسرین نے اس سورت کی شان نزول میں کئ روایتیں نقل کی ہیں۔ سب کے ملانے سے یہ معلوم ہوتا ہے کہ یہود نے مشرکین مکہ کے ذریعہ سے امتحانًا یہ سوال کیا کہ حضرت ابراہیمؑ اور ان کی اولاد تو شام میں رہتی تھی ، پھر \\\"بنی اسرائیل\\\" مصر میں کیسے پہنچ گئے جو موسٰیؑ کو فرعون سے مقابلہ کی نوبت آئی۔ شاید مسلمانوں کو بھی ایک مفصل تاریخی واقعہ جو بصائر و بر سے معلوم  ہو سننے کا اشتیاق ہوا ہو گا۔ ادھر اس قصہ کے ضمن میں جن احوال و حوادث کا تذکرہ ہونے والا تھا، وہ کئ طرح نبی کریم ﷺ اور آپ کی قوم کے حالات سے مشابہت رکھتے تھے ۔ اور ان کا ذکر آنحضرت ﷺ کے حق میں موجب تسکین خاطر اور آپ کی قوم کے حق میں موجب عبرت تھا۔ ان وجوہ سے یہ پورا واقعہ کافی بسط و تفصیل سے قرآن کریم میں بیان فرمایا ۔ تا پڑھنے والوں کو معلوم ہو جائے کہ اسرائیل (یعنی حضرت یعقوبؑ) اور ان کی اولاد کے شام سے مصر آنے کا سبب حضرت یوسفؑ کا واقعہ ہوا ہے۔ پھر وہیں ان کی نسل پھیلی اور بڑھتی رہی تاآنکہ حضرت موسٰیؑ نے آکر فرعون اور قبطیوں کی غلامی سے انہیں نجات دلائی۔\"}"
                },
                "surah": 12,
                "ayah": 3,
                "notes": "Surah Yusuf 12:1-7"
            },
            {
                "unit_id": "U:QURAN:12:1-7",
                "unit_type": "ayah",
                "arabic": "إذ قال يوسف لأبيه يا أبت إني رأيت أحد عشر كوكبا والشمس والقمر رأيتهم لي ساجدين",
                "arabic_diacritics": "إِذۡ قَالَ يُوسُفُ لِأَبِيهِ يَٰٓأَبَتِ إِنِّي رَأَيۡتُ أَحَدَ عَشَرَ كَوۡكَبٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ رَأَيۡتُهُمۡ لِي سَٰجِدِينَ ٤",
                "arabic_non_diacritics": "إذ قال يوسف لأبيه يا أبت إني رأيت أحد عشر كوكبا والشمس والقمر رأيتهم لي ساجدين",
                "translation": "\"Joseph said to his father, ‘Father, I dreamed of eleven stars and the sun and the moon: I saw them all bow down before me,’\"",
                "translations": {
                    "haleem": "\"Joseph said to his father, ‘Father, I dreamed of eleven stars and the sun and the moon: I saw them all bow down before me,’\"",
                    "asad": "LO! Thus spoke Joseph unto his father: \"O my father! Behold, I saw [in a dream] eleven stars, as well as the sun and the moon: I saw them prostrate themselves before me!\"",
                    "sahih": "\"[Of these stories mention] when Joseph said to his father,<sup foot_note=\\\"226974\\\">1</sup> \\\"O my father, indeed I have seen [in a dream] eleven stars and the sun and the moon; I saw them prostrating to me.\\\"\"",
                    "usmani": "\"جس وقت کہا یوسف نے اپنے باپ سے اے باپ میں نے دیکھا خواب میں گیارہ ستاروں کو اور سورج کو اور چاند کو دیکھا میں نے انکو اپنے واسطے سجدہ کرتے ہوئے<sup foot_note=\\\"83911\\\">1</sup>\"",
                    "footnotes_sahih": "{\"226974\":\"- The prophet Jacob (upon whom be peace).\"}",
                    "footnotes_usmani": "{\"83911\":\"<strong class=h>حضرت یوسف علیہ السلام کا خواب:</strong>یعنی گیارہ ستارے اور چاند سورج میرے آگے جھک رہے اور پست ہو رہے ہیں۔ یہ خواب لڑکپن میں دیکھا تھا۔ سچ ہے \\\"ہونہار بروے کے چکنے چکنے پات\\\"\"}"
                },
                "surah": 12,
                "ayah": 4,
                "notes": "Surah Yusuf 12:1-7"
            },
            {
                "unit_id": "U:QURAN:12:1-7",
                "unit_type": "ayah",
                "arabic": "قال يا بني لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا إن الشيطان للإنسان عدو مبين",
                "arabic_diacritics": "قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ ٥",
                "arabic_non_diacritics": "قال يا بني لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا إن الشيطان للإنسان عدو مبين",
                "translation": "\"and he replied, ‘My son, tell your brothers nothing of this dream, or they may plot to harm you––Satan is man’s sworn enemy.\"",
                "translations": {
                    "haleem": "\"and he replied, ‘My son, tell your brothers nothing of this dream, or they may plot to harm you––Satan is man’s sworn enemy.\"",
                    "asad": "[Jacob] replied: \"O my dear son! Do not relate thy dream to thy brothers lest [out of envy] they devise an evil scheme against thee; verily, Satan is man's open foe!",
                    "sahih": "\"He said, \\\"O my son, do not relate your vision to your brothers or they will contrive against you a plan. Indeed Satan, to man, is a manifest enemy.\"",
                    "usmani": "\"کہا اے بیٹے مت بیان کرنا خواب اپنا اپنے بھائیوں کے آگے پھر وہ بنائیں گے تیرے واسطے کچھ فریب البتہ شیطان ہے انسان کا صریح دشمن<sup foot_note=\\\"83912\\\">1</sup>\"",
                    "footnotes_sahih": "{}",
                    "footnotes_usmani": "{\"83912\":\"<strong class=h>حضرت یوسف علیہ السلام کا خواب:</strong>یعنی شیطان ہر وقت انسان کی گھات میں لگا ہے۔ وسوسہ اندازی کر کے بھائیوں کو تیرے خلاف اکسا دے گا۔ کیونکہ خواب کی تعبیر بہت ظاہر تھی ، اور یوسفؑ کے بھائیوں کو جو بہرحال خاندان نبوت میں سے تھے ، ایسے واضح خواب کا سمجھ لینا کچھ مشکل نہ تھے کہ گیارہ ستارے گیارہ بھائی ہیں اور چاند سورج ماں باپ ہیں گویا یہ سب کسی وقت یوسفؑ کی عظمت شان کے سامنے سر جھکائیں گے۔\\r\\nبرادران یوسفؑ:\\r\\nچنانچہ آخر سورت میں<span class=indopak>  یٰۤاَبَتِ ہٰذَا تَاۡوِیۡلُ رُءۡیَایَ مِنۡ قَبۡلُ ۫ قَدۡ جَعَلَہَا رَبِّیۡ حَقًّا </span>(یوسف۔۱۰۰) کہہ کر اسی طرف اشارہ کیا۔ معلوم ہوتا ہے کہ حضرت یعقوبؑ خواب سے پیشتر ہی یہ محسوس کرتے تھے کہ یوسفؑ کے ساتھ باپ کی خصوصی محبت کو دیکھ کر اس کے علاقی بھائی دل ہی دل میں کڑھتے ہیں ۔ اب انہوں نے خیال کیا کہ اگر کہیں یہ خواب سن پائے تو شیطان حسد کی آگ ان کے دلوں میں بھڑکا دے گا اور جوش حسد میں آنکھیں بند کر کے ممکن ہے وہ کوئی ایسی حرکت کر گذریں جو یوسفؑ کی اذیت اور خود ان کی رسوائی اور بد انجامی کو موجب ہو۔ اس لئے آپ نے یوسفؑ کو منع فرما دیا کہ اپنا خواب بھائیوں کے روبرو ظاہر نہ کریں۔ یوسفؑ کا ایک حقیقی بھائی \\\"بنیامین\\\" تھا۔ اس کے سامنے ذکر کرنے کی بھی اجازت نہیں دی، گو اس سے برائی کا کچھ اندیشہ نہ تھا، لیکن یہ ممکن تھا کہ وہ سن کر بے احتیاطی سے دوسروں کے سامنے تذکرہ کر دے۔ اور اس طرح یہ خبر لوگوں میں شائع ہو جائے (تنبیہ) حافظ ابن تیمیہؒ نے ایک مستقل رسالہ میں لکھا ہے کہ قرآن لغت ، اور عقلی اعتبارات میں سے کوئی چیز اس خیال کی تائید نہیں کرتی کہ برادران یوسفؑ انبیاء تھے ، نہ رسول کریم ﷺ نے اس کی خبر دی نہ صحابہؓ میں کوئی اس کا قائل تھا بھلا عقوق والدین ، قطع رحم ، مسلمان بھائی کے قتل پر اقدام کرنا ، اس کو غلام بنا کر بیچ ڈالنا اور بلاد کفر کی طرف بھیج دینا ، پھر صریح جھوٹ اور حیلے بنانا ، وغیرہ ایسی حرکات شنیعہ کیا کسی نبی کی طرف (خواہ قبل از بعثت ہی سہی) منسوب کی جا سکتی ہیں (العیاذ باللہ) جن لوگوں نے برادران یوسفؑ کی نبوت کا خیال ظاہر کیا ہے ، ان کے پاس لفظ \\\"اسباط\\\" کے سوا کوئی دلیل نہیں۔ حالانکہ \\\"اسباط\\\" خاص صلبی اولاد کو نہیں بلکہ اقوام و امم کو کہتے ہیں۔ اور بنی اسرائیل کی اسباط پر تقسیم حضرت موسٰیؑ کے عہد میں ہوئی۔\"}"
                },
                "surah": 12,
                "ayah": 5,
                "notes": "Surah Yusuf 12:1-7"
            },
            {
                "unit_id": "U:QURAN:12:1-7",
                "unit_type": "ayah",
                "arabic": "وكذلك يجتبيك ربك ويعلمك من تأويل الأحاديث ويتم نعمته عليك وعلى آل يعقوب كما أتمها على أبويك من قبل إبراهيم وإسحاق إن ربك عليم حكيم",
                "arabic_diacritics": "وَكَذَٰلِكَ يَجۡتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأۡوِيلِ ٱلۡأَحَادِيثِ وَيُتِمُّ نِعۡمَتَهُۥ عَلَيۡكَ وَعَلَىٰٓ ءَالِ يَعۡقُوبَ كَمَآ أَتَمَّهَا عَلَىٰٓ أَبَوَيۡكَ مِن قَبۡلُ إِبۡرَٰهِيمَ وَإِسۡحَٰقَۚ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٞ ٦",
                "arabic_non_diacritics": "وكذلك يجتبيك ربك ويعلمك من تأويل الأحاديث ويتم نعمته عليك وعلى آل يعقوب كما أتمها على أبويك من قبل إبراهيم وإسحاق إن ربك عليم حكيم",
                "translation": "\"This is about how your Lord will choose you, teach you to interpret dreams, and perfect His blessing on you and the House of Jacob, just as He perfected it earlier on your forefathers Abraham and Isaac: your Lord is all knowing and wise.’\"",
                "translations": {
                    "haleem": "\"This is about how your Lord will choose you, teach you to interpret dreams, and perfect His blessing on you and the House of Jacob, just as He perfected it earlier on your forefathers Abraham and Isaac: your Lord is all knowing and wise.’\"",
                    "asad": "For, [as thou hast been shown in thy dream,] even thus will thy Sustainer elect thee, and will impart unto thee some understanding of the inner meaning of happenings, and will bestow the full measure of His blessings upon thee and upon the House of Jacob -even as, aforetime, He bestowed it in full measure upon thy forefathers Abraham and Isaac. Verily, thy Sustainer is all-knowing, wise!\"",
                    "sahih": "\"And thus will your Lord choose you and teach you the interpretation of narratives [i.e., events or dreams] and complete His favor upon you and upon the family of Jacob, as He completed it upon your fathers before, Abraham and Isaac. Indeed, your Lord is Knowing and Wise.\\\"\"",
                    "usmani": "\"اور اسی طرح برگزیدہ کرے گا تجھ کو تیرا رب<sup foot_note=\\\"83913\\\">1</sup> اور سکھلائے گا تجھ کو ٹھکانے پر لگانا باتوں کا<sup foot_note=\\\"83914\\\">2</sup> اور پورا کرے گا اپنا انعام تجھ پر اور یعقوب کے گھر پر<sup foot_note=\\\"83915\\\">3</sup> جیسا پورا کیا ہے تیرے دو باپ دادوں پر اس سے پہلے ابراہیم اور اسحٰق پر<sup foot_note=\\\"83916\\\">4</sup> البتہ تیرا رب خبردار ہے حکمت والا<sup foot_note=\\\"83917\\\">5</sup>\"",
                    "footnotes_sahih": "{}",
                    "footnotes_usmani": "{\"83913\":\"<strong class=h>حضرت یوسف علیہ السلام کی نبوت کی پیشگوئی:</strong>یعنی جس طرح ایسا اچھا خواب دکھلایا ، اسی طرح محض جاذبہ رحمت سے اپنی بارگاہ قرب میں تجھ کو خصوصی مقام عطاء فرمائے گا۔ چنانچہ نبوت عطاء فرمائی اور طرح طرح کی ظاہری و باطنی نوازشیں کیں۔\",\"83914\":\"<strong class=h>حضرت یوسف علیہ السلام کو تعبیر خواب کا علم:</strong>مثلاً تعبیر رؤیا ، یعنی خواب سن کر اس کے اجزا کو ذہانت و فراست سے ٹھکانے لگا دینا۔ یا ہر بات کے موقع و محل کو سمجھنا ، اور معاملات کے عواقب و نتائج کو فورًا پرکھ لینا۔ یا خدا اور پیغمبروں کے ارشادات اقوام و اممم کے قصص اور کتب منزلہ کے مضامین کی تہ تک پہنچ جانا ۔ یہ سب چیزیں \\\"تاویل الاحادیث کے تحت میں مندرج ہو سکتی ہیں\\\"،\",\"83915\":\"یعنی اخروی نعمتوں کے ساتھ دنیوی نعمتیں عطا فرمائے گا۔ نبوت کے ساتھ ! بادشاہت میں حصہ دے گا اور شدائد و محن سے نجات دے کر خوشحالی و فراغ بالی کی زندگی نصیب کرے گا۔\",\"83917\":\"یعنی وہ ہر ایک کی مناسبت و استعداد سے باخبر ہے اپنی حکمت سے اسی کے مناسب فیض پہنچاتا ہے۔\",\"83916\":\"یعقوبؑ کے گھرانے کو دنیوی مکروہات اور مادی تکلیفوں سے رہائی دے گا اور آئندہ ان کی نسل سے بڑے بڑے پیغمبر اور بادشاہ پیدا کرے گا۔ حضرت یعقوبؑ نے تواضعًا اپنا نام نہیں لیا۔ اپنے والد حضرت اسحاقؑ اور ان کے والد حضرت ابراہیمؑ کا ذکر فرمایا۔ حضرت ابراہیمؑ کو خدا نے اپنا خلیل اوعر نبی بنایا ، ان کے دشمن نمرود کا ہلاک کیا، آگ کے شعلوں کو ان کے لئے گلزار بنا دیا، حضرت اسحاقؑ کو نبوت عطا کی ، پھر ان کے سلب سے حضرت یعقوبؑ جیسا نبی پیدا کیا ۔ جس سے تمام  انبیائے بنی اسرائیل کا سلسلہ چلا۔ حدیث صحیح میں ہے ۔ \\\"الکریم ابن الکریم ابن الکریم ابن الکریم یوسف بن یعقوب بن اسحٰق بن ابراھیم\\\" (تنبیہ۹ حضرت یعقوبؑ نے جو پیشنگوئی کی اس کا کچھ حصہ تو غالبًا حضرت یوسفؑ کے خواب سے سمجھے اور اس سے کہ اتنی چھوٹی عمر میں ایسا موزوں و مبارک خواب دیکھا۔ اور کچھ حضرت یوسفؑ کے خصائل و شمائل سے یا وحی الہٰی کے ذریعہ سے مطلع ہوئے ہوں گے۔\"}"
                },
                "surah": 12,
                "ayah": 6,
                "notes": "Surah Yusuf 12:1-7"
            },
            {
                "unit_id": "U:QURAN:12:1-7",
                "unit_type": "ayah",
                "arabic": "لقد كان في يوسف وإخوته آيات للسائلين",
                "arabic_diacritics": "۞ لَّقَدۡ كَانَ فِي يُوسُفَ وَإِخۡوَتِهِۦٓ ءَايَٰتٞ لِّلسَّآئِلِينَ ٧",
                "arabic_non_diacritics": "لقد كان في يوسف وإخوته آيات للسائلين",
                "translation": "\"There are lessons in the story of Joseph and his brothers for all who seek them.\"",
                "translations": {
                    "haleem": "\"There are lessons in the story of Joseph and his brothers for all who seek them.\"",
                    "asad": "Indeed, in [the story of] Joseph and his brothers there are messages for all who search [after truth].",
                    "sahih": "\"Certainly were there in Joseph and his brothers signs for those who ask, [such as]\"",
                    "usmani": "\"البتہ ہیں یوسف کے قصہ میں اور اس کے بھائیوں کے قصہ میں نشانیاں پوچھنے والوں کے لئے<sup foot_note=\\\"83918\\\">1</sup>\"",
                    "footnotes_sahih": "{}",
                    "footnotes_usmani": "{\"83918\":\"<strong class=h>قصہ یوسف علیہ السلام میں نشانیاں ہیں:</strong>یعنی جو لوگ اس طرح کے واقعات دریافت کر کے کسی نتیجہ پر پہنچنا چاہتے ہیں ان کے لئے یوسفؑ اور ان کے بھائیوں کی سرگذشت میں ہدیات و عبرت کی بہت سے نشانیاں موجود ہیں۔ اس قسہ کو سن کو قلوب میں حق تعالیٰ کی عظیم قدرت و حکمت کا نقش جم جاتا ہے۔ نبی کریم ﷺ کی صداقت کا بین ثبوت ملتا ہے کہ آپ باوجود امّی ہونے اور کسی کتاب یا معلم سے استفادہ نہ کرنے کے ایسے منقح و منضبط تاریخی حقائق کا انکشاف فرما رہے ہیں جن کے بیان کی بجز اعلام ربانی کے کوئی توجہیہ نہیں ہو سکتی۔ خصوصًا قریش مکہ کے لئے (جو یہود کے اکسانے سے اس قصہ کے متعلق حضور ﷺ سے سوال کر رہے تھے) اس واقع میں بڑا عبرت آمقز سبق ہے کہ جس طرح حضرت یوسفؑ کو بھائیوں نے گھر سے نکالا ، زاراہ حسد قتل یا جلاسطن کرنے کے مشورے کئے ۔ طرح طرح سے ایذا۴یں پہنچا۴یں۔ اہانت و استخفاف میں کوئی دقیقہ اتھا نہ رکھا آکر ایک دن آیا کہ یوسفؑ کی طرح نادم و محتاج ہو کر آئے۔ یوسفؑ کو خدا نے دین و دنیا کے اعلیٰ مناصب پر فائز کیا اور انہوں نے اپنے عروج و اقتدار کے وقت بھائیوں کے جرائم سے چشم پوشی کی اور نہایت دریا دلی سے سب کے قصور معاف کر دیے۔ ٹھیک اسی طرح حضرت محمد رسول اللہ ﷺ کی برادری نے آپ کے متعلق ناپاک منصوبے باندھے ۔ دکھ پہنچا۴ے ، عزت و آبرو پر حملے کئے، حتٰی کہ وطن چھوڑنے پر مجبور کیا۔ لیکن جلد وہ دن آنے والا تھا جب وطن سے علیحدہ ہو کر آپ کی کامیابی اور رفعت شان کا آفتاب چمکا ، اور چند سال کے بعد فتح مکہ کا وہ تاریخی دن آ پہنچا جبکہ آپ نے اپنے قومی اور وطنی بھائیوں کی گذشتہ تقصیرات پر بعینہ حضرت یوسفؑ والے کلمات \\\"لاتثریب علیکم الیوم\\\" فرما کر قلم عفو کھینچ دیا۔\"}"
                },
                "surah": 12,
                "ayah": 7,
                "notes": "Surah Yusuf 12:1-7"
            },
            {
                "unit_id": "U:QURAN:12:1",
                "unit_type": "ayah",
                "arabic": "بسم الله الرحمن الرحيم الر تلك آيات الكتاب المبين",
                "arabic_diacritics": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ ١",
                "arabic_non_diacritics": "بسم الله الرحمن الرحيم الر تلك آيات الكتاب المبين",
                "translation": "\"Alif Lam Ra These are the verses of the Scripture that makes things clear––\"",
                "translations": {
                    "haleem": "\"Alif Lam Ra These are the verses of the Scripture that makes things clear––\"",
                    "asad": "Alif. Lam. Ra. THESE ARE MESSAGES of a revelation clear in itself and clearly showing the truth:",
                    "sahih": "\"Alif, Lām, Rā.<sup foot_note=\\\"226972\\\">1</sup> These are the verses of the clear Book.\"",
                    "usmani": "\"یہ آیتیں ہیں واضح کتاب کی<sup foot_note=\\\"83908\\\">1</sup>\"",
                    "footnotes_sahih": "{\"226972\":\"- See footnote to 2:1.\"}",
                    "footnotes_usmani": "{\"83908\":\"جس کا من عنداللہ ہونا بالکل واضح ہے اور جن احکام و شرائع یا مواعظ و نصائح پر وہ مشتمل ہے نہایت روشن اور صاف ہیں۔\"}"
                },
                "surah": 12,
                "ayah": 1,
                "notes": "Surah Yusuf 12:1"
            },
            {
                "unit_id": "U:QURAN:12:2",
                "unit_type": "ayah",
                "arabic": "إنا أنزلناه قرآنا عربيا لعلكم تعقلون",
                "arabic_diacritics": "إِنَّآ أَنزَلۡنَٰهُ قُرۡءَٰنًا عَرَبِيّٗا لَّعَلَّكُمۡ تَعۡقِلُونَ ٢",
                "arabic_non_diacritics": "إنا أنزلناه قرآنا عربيا لعلكم تعقلون",
                "translation": "\"We have sent it down as an Arabic Quran so that you [people] may understand.\"",
                "translations": {
                    "haleem": "\"We have sent it down as an Arabic Quran so that you [people] may understand.\"",
                    "asad": "behold, We have bestowed it from on high as a discourse in the Arabic tongue, so that you might encompass it with your reason.",
                    "sahih": "\"Indeed, We have sent it down as an Arabic Qur’ān<sup foot_note=\\\"226973\\\">1</sup> that you might understand.\"",
                    "usmani": "\"ہم نے اس کو اتارا ہے قرآن عربی زبان کا تاکہ تم سمجھ لو<sup foot_note=\\\"83909\\\">1</sup>\"",
                    "footnotes_sahih": "{\"226973\":\"- i.e., revealed in the Arabic language.\"}",
                    "footnotes_usmani": "{\"83909\":\"<strong class=h>عربی میں قرآن کے نزول کی حکمت:</strong>یعنی عربی زبان جو تمام زبانوں میں زیادہ فصیح و وسیع اور منضبط و پر شوکت زبان ہے ، نزول قرآن کے لئے منتخب کی گئ۔ جب خود پیغمبر عربی ہیں تو ظاہر ہے کہ دنیا میں اس کے اولین مخاطب عرب ہوں گے ۔ پھر عرب کے ذریعہ سے چاروں طرف یہ روشنی پھیلے گی۔ اسی کی طرف<span class=indopak> لَّعَلَّکُمۡ تَعۡقِلُوۡنَ </span>میں اشارہ فرمایا کہ تمہاری زبان میں اتارنے کی ایک وجہ یہ ہے کہ تم جو پیغمبرؑ کی قوم ہو اول اس کے علوم و معارف کا مزہ چکھو پھر دوسروں کو چکھاؤ۔ چنانچہ ایسا ہی ہوا۔ ابن کثیر لکھتے ہیں۔<span class=indopak> اُنْزِلَ اَشْرَفُ الْکُتُبِ بِاَشْرَفِ اللُغَاتِ عَلٰی اَشْرَفِ الرُّسُلِ بِسِفَارَۃِ اَشْرَفِ الْمَلَائِکَۃِ وَکَانَ ذٰلِکَ فِی اَشْرَفِ بَقَاعِ الْاَرْضِ وَاِبْتَدَاءُ اِنزالِہِ فِی اَشْرَفِ شھُوْرِ السَّنَۃِ وَھُوَ رَمْضَانُ۔ فَکمُلَ مِنْ کُلِّ الوُجُوْہِ </span>۔\"}"
                },
                "surah": 12,
                "ayah": 2,
                "notes": "Surah Yusuf 12:2"
            },
            {
                "unit_id": "U:QURAN:12:3",
                "unit_type": "ayah",
                "arabic": "نحن نقص عليك أحسن القصص بما أوحينا إليك هذا القرآن وإن كنت من قبله لمن الغافلين",
                "arabic_diacritics": "نَحۡنُ نَقُصُّ عَلَيۡكَ أَحۡسَنَ ٱلۡقَصَصِ بِمَآ أَوۡحَيۡنَآ إِلَيۡكَ هَٰذَا ٱلۡقُرۡءَانَ وَإِن كُنتَ مِن قَبۡلِهِۦ لَمِنَ ٱلۡغَٰفِلِينَ ٣",
                "arabic_non_diacritics": "نحن نقص عليك أحسن القصص بما أوحينا إليك هذا القرآن وإن كنت من قبله لمن الغافلين",
                "translation": "\"We tell you [Prophet] the best of stories in revealing this Quran to you. Before this you were one of those who knew nothing about them.\"",
                "translations": {
                    "haleem": "\"We tell you [Prophet] the best of stories in revealing this Quran to you. Before this you were one of those who knew nothing about them.\"",
                    "asad": "In the measure that We reveal this Qur'an unto thee, [O Prophet,] We explain it to thee in the best possible way, seeing that ere this thou wert indeed among those who are unaware [of what revelation is].",
                    "sahih": "\"We relate to you, [O Muḥammad], the best of stories in what We have revealed to you of this Qur’ān although you were, before it, among the unaware.\"",
                    "usmani": "\"ہم بیان کرتے ہیں تیرے پاس بہت اچھا بیان اس واسطے کہ بھیجا ہم نے تیری طرف یہ قرآن اور تو تھا اس سے پہلے البتہ بیخبروں میں<sup foot_note=\\\"83910\\\">1</sup>\"",
                    "footnotes_sahih": "{}",
                    "footnotes_usmani": "{\"83910\":\"<strong class=h>احسن القصص کی وجہ نزول:</strong>یعنی اس وحی کے ذریعہ سے جو قرآن کی صورت میں تم پر نازل ہوتی ہے۔ ہم ایک نہایت اچھا بیان نہایت حسین طرز میں تم کو سناتے ہیں۔ جس سے اب تک اپنی قوم کی طرح تم بھی بے خبر تھے ۔ گو یہ واقع کتب تاریخ اور بائیبل میں پہلے سے مذکور تھا مگر محض ایک افسانہ کی صورت میں تھا۔ قرآن کریم نے اس کے ضروری اور مفید اجزاء کو ایسی عجیب ترتیب اور بلیغ و موثر انداز میں بیان فرمایا جس نے نہ صرف پہلے تذکرہ نویسوں کی کوتاہیوں پر مطلع کیا بلکہ موقع بہ موقع نہات ہی اعلیٰ نتائج کی طرف رہنمائی کی اور قصہ کے ضمن میں علوم و ہدایات کے ابواب مفتوح کر دئے۔ یہ بات کہ خداوند قدوس کی تقدیر کو کوئی چیز نہیں روک سکتی ، اور خدا جب کسی پر فضل کرنا چاہے تو سارا جہان مل کر بھی اپنی ساری امکانی تدابیر سے اسے محروم نہیں کر سکتا، صبر و اسقامت دنیوی و اخری کامیابی کی کلید ہے ، حسد و عداوت کا انجام خذلان و نقصان کے سوا کچھ نہیں ، عقل انسانی بڑا شریف جوہر ہے جس کی بدولت آدمی بہت سی مشکلات پر غالب آتا اور اپنی زندگی کو کامیاب بنا لیتا ہے ۔ اخلاقی شرافت اور پاکدامنی انسان کو دشمنوں اور حاسدوں کی نظر میں بھی آخر کار معزز بنا دیتی ہے۔ یہ اور اس قسم کے بے شمار حقائق ہیں جن پر اس احسن القصص کے ضمن میں متنبہ فرمایا ہے ۔ مفسرین نے اس سورت کی شان نزول میں کئ روایتیں نقل کی ہیں۔ سب کے ملانے سے یہ معلوم ہوتا ہے کہ یہود نے مشرکین مکہ کے ذریعہ سے امتحانًا یہ سوال کیا کہ حضرت ابراہیمؑ اور ان کی اولاد تو شام میں رہتی تھی ، پھر \\\"بنی اسرائیل\\\" مصر میں کیسے پہنچ گئے جو موسٰیؑ کو فرعون سے مقابلہ کی نوبت آئی۔ شاید مسلمانوں کو بھی ایک مفصل تاریخی واقعہ جو بصائر و بر سے معلوم  ہو سننے کا اشتیاق ہوا ہو گا۔ ادھر اس قصہ کے ضمن میں جن احوال و حوادث کا تذکرہ ہونے والا تھا، وہ کئ طرح نبی کریم ﷺ اور آپ کی قوم کے حالات سے مشابہت رکھتے تھے ۔ اور ان کا ذکر آنحضرت ﷺ کے حق میں موجب تسکین خاطر اور آپ کی قوم کے حق میں موجب عبرت تھا۔ ان وجوہ سے یہ پورا واقعہ کافی بسط و تفصیل سے قرآن کریم میں بیان فرمایا ۔ تا پڑھنے والوں کو معلوم ہو جائے کہ اسرائیل (یعنی حضرت یعقوبؑ) اور ان کی اولاد کے شام سے مصر آنے کا سبب حضرت یوسفؑ کا واقعہ ہوا ہے۔ پھر وہیں ان کی نسل پھیلی اور بڑھتی رہی تاآنکہ حضرت موسٰیؑ نے آکر فرعون اور قبطیوں کی غلامی سے انہیں نجات دلائی۔\"}"
                },
                "surah": 12,
                "ayah": 3,
                "notes": "Surah Yusuf 12:3"
            },
            {
                "unit_id": "U:QURAN:12:4",
                "unit_type": "ayah",
                "arabic": "إذ قال يوسف لأبيه يا أبت إني رأيت أحد عشر كوكبا والشمس والقمر رأيتهم لي ساجدين",
                "arabic_diacritics": "إِذۡ قَالَ يُوسُفُ لِأَبِيهِ يَٰٓأَبَتِ إِنِّي رَأَيۡتُ أَحَدَ عَشَرَ كَوۡكَبٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ رَأَيۡتُهُمۡ لِي سَٰجِدِينَ ٤",
                "arabic_non_diacritics": "إذ قال يوسف لأبيه يا أبت إني رأيت أحد عشر كوكبا والشمس والقمر رأيتهم لي ساجدين",
                "translation": "\"Joseph said to his father, ‘Father, I dreamed of eleven stars and the sun and the moon: I saw them all bow down before me,’\"",
                "translations": {
                    "haleem": "\"Joseph said to his father, ‘Father, I dreamed of eleven stars and the sun and the moon: I saw them all bow down before me,’\"",
                    "asad": "LO! Thus spoke Joseph unto his father: \"O my father! Behold, I saw [in a dream] eleven stars, as well as the sun and the moon: I saw them prostrate themselves before me!\"",
                    "sahih": "\"[Of these stories mention] when Joseph said to his father,<sup foot_note=\\\"226974\\\">1</sup> \\\"O my father, indeed I have seen [in a dream] eleven stars and the sun and the moon; I saw them prostrating to me.\\\"\"",
                    "usmani": "\"جس وقت کہا یوسف نے اپنے باپ سے اے باپ میں نے دیکھا خواب میں گیارہ ستاروں کو اور سورج کو اور چاند کو دیکھا میں نے انکو اپنے واسطے سجدہ کرتے ہوئے<sup foot_note=\\\"83911\\\">1</sup>\"",
                    "footnotes_sahih": "{\"226974\":\"- The prophet Jacob (upon whom be peace).\"}",
                    "footnotes_usmani": "{\"83911\":\"<strong class=h>حضرت یوسف علیہ السلام کا خواب:</strong>یعنی گیارہ ستارے اور چاند سورج میرے آگے جھک رہے اور پست ہو رہے ہیں۔ یہ خواب لڑکپن میں دیکھا تھا۔ سچ ہے \\\"ہونہار بروے کے چکنے چکنے پات\\\"\"}"
                },
                "surah": 12,
                "ayah": 4,
                "notes": "Surah Yusuf 12:4"
            },
            {
                "unit_id": "U:QURAN:12:5",
                "unit_type": "ayah",
                "arabic": "قال يا بني لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا إن الشيطان للإنسان عدو مبين",
                "arabic_diacritics": "قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ ٥",
                "arabic_non_diacritics": "قال يا بني لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا إن الشيطان للإنسان عدو مبين",
                "translation": "\"and he replied, ‘My son, tell your brothers nothing of this dream, or they may plot to harm you––Satan is man’s sworn enemy.\"",
                "translations": {
                    "haleem": "\"and he replied, ‘My son, tell your brothers nothing of this dream, or they may plot to harm you––Satan is man’s sworn enemy.\"",
                    "asad": "[Jacob] replied: \"O my dear son! Do not relate thy dream to thy brothers lest [out of envy] they devise an evil scheme against thee; verily, Satan is man's open foe!",
                    "sahih": "\"He said, \\\"O my son, do not relate your vision to your brothers or they will contrive against you a plan. Indeed Satan, to man, is a manifest enemy.\"",
                    "usmani": "\"کہا اے بیٹے مت بیان کرنا خواب اپنا اپنے بھائیوں کے آگے پھر وہ بنائیں گے تیرے واسطے کچھ فریب البتہ شیطان ہے انسان کا صریح دشمن<sup foot_note=\\\"83912\\\">1</sup>\"",
                    "footnotes_sahih": "{}",
                    "footnotes_usmani": "{\"83912\":\"<strong class=h>حضرت یوسف علیہ السلام کا خواب:</strong>یعنی شیطان ہر وقت انسان کی گھات میں لگا ہے۔ وسوسہ اندازی کر کے بھائیوں کو تیرے خلاف اکسا دے گا۔ کیونکہ خواب کی تعبیر بہت ظاہر تھی ، اور یوسفؑ کے بھائیوں کو جو بہرحال خاندان نبوت میں سے تھے ، ایسے واضح خواب کا سمجھ لینا کچھ مشکل نہ تھے کہ گیارہ ستارے گیارہ بھائی ہیں اور چاند سورج ماں باپ ہیں گویا یہ سب کسی وقت یوسفؑ کی عظمت شان کے سامنے سر جھکائیں گے۔\\r\\nبرادران یوسفؑ:\\r\\nچنانچہ آخر سورت میں<span class=indopak>  یٰۤاَبَتِ ہٰذَا تَاۡوِیۡلُ رُءۡیَایَ مِنۡ قَبۡلُ ۫ قَدۡ جَعَلَہَا رَبِّیۡ حَقًّا </span>(یوسف۔۱۰۰) کہہ کر اسی طرف اشارہ کیا۔ معلوم ہوتا ہے کہ حضرت یعقوبؑ خواب سے پیشتر ہی یہ محسوس کرتے تھے کہ یوسفؑ کے ساتھ باپ کی خصوصی محبت کو دیکھ کر اس کے علاقی بھائی دل ہی دل میں کڑھتے ہیں ۔ اب انہوں نے خیال کیا کہ اگر کہیں یہ خواب سن پائے تو شیطان حسد کی آگ ان کے دلوں میں بھڑکا دے گا اور جوش حسد میں آنکھیں بند کر کے ممکن ہے وہ کوئی ایسی حرکت کر گذریں جو یوسفؑ کی اذیت اور خود ان کی رسوائی اور بد انجامی کو موجب ہو۔ اس لئے آپ نے یوسفؑ کو منع فرما دیا کہ اپنا خواب بھائیوں کے روبرو ظاہر نہ کریں۔ یوسفؑ کا ایک حقیقی بھائی \\\"بنیامین\\\" تھا۔ اس کے سامنے ذکر کرنے کی بھی اجازت نہیں دی، گو اس سے برائی کا کچھ اندیشہ نہ تھا، لیکن یہ ممکن تھا کہ وہ سن کر بے احتیاطی سے دوسروں کے سامنے تذکرہ کر دے۔ اور اس طرح یہ خبر لوگوں میں شائع ہو جائے (تنبیہ) حافظ ابن تیمیہؒ نے ایک مستقل رسالہ میں لکھا ہے کہ قرآن لغت ، اور عقلی اعتبارات میں سے کوئی چیز اس خیال کی تائید نہیں کرتی کہ برادران یوسفؑ انبیاء تھے ، نہ رسول کریم ﷺ نے اس کی خبر دی نہ صحابہؓ میں کوئی اس کا قائل تھا بھلا عقوق والدین ، قطع رحم ، مسلمان بھائی کے قتل پر اقدام کرنا ، اس کو غلام بنا کر بیچ ڈالنا اور بلاد کفر کی طرف بھیج دینا ، پھر صریح جھوٹ اور حیلے بنانا ، وغیرہ ایسی حرکات شنیعہ کیا کسی نبی کی طرف (خواہ قبل از بعثت ہی سہی) منسوب کی جا سکتی ہیں (العیاذ باللہ) جن لوگوں نے برادران یوسفؑ کی نبوت کا خیال ظاہر کیا ہے ، ان کے پاس لفظ \\\"اسباط\\\" کے سوا کوئی دلیل نہیں۔ حالانکہ \\\"اسباط\\\" خاص صلبی اولاد کو نہیں بلکہ اقوام و امم کو کہتے ہیں۔ اور بنی اسرائیل کی اسباط پر تقسیم حضرت موسٰیؑ کے عہد میں ہوئی۔\"}"
                },
                "surah": 12,
                "ayah": 5,
                "notes": "Surah Yusuf 12:5"
            },
            {
                "unit_id": "U:QURAN:12:6",
                "unit_type": "ayah",
                "arabic": "وكذلك يجتبيك ربك ويعلمك من تأويل الأحاديث ويتم نعمته عليك وعلى آل يعقوب كما أتمها على أبويك من قبل إبراهيم وإسحاق إن ربك عليم حكيم",
                "arabic_diacritics": "وَكَذَٰلِكَ يَجۡتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأۡوِيلِ ٱلۡأَحَادِيثِ وَيُتِمُّ نِعۡمَتَهُۥ عَلَيۡكَ وَعَلَىٰٓ ءَالِ يَعۡقُوبَ كَمَآ أَتَمَّهَا عَلَىٰٓ أَبَوَيۡكَ مِن قَبۡلُ إِبۡرَٰهِيمَ وَإِسۡحَٰقَۚ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٞ ٦",
                "arabic_non_diacritics": "وكذلك يجتبيك ربك ويعلمك من تأويل الأحاديث ويتم نعمته عليك وعلى آل يعقوب كما أتمها على أبويك من قبل إبراهيم وإسحاق إن ربك عليم حكيم",
                "translation": "\"This is about how your Lord will choose you, teach you to interpret dreams, and perfect His blessing on you and the House of Jacob, just as He perfected it earlier on your forefathers Abraham and Isaac: your Lord is all knowing and wise.’\"",
                "translations": {
                    "haleem": "\"This is about how your Lord will choose you, teach you to interpret dreams, and perfect His blessing on you and the House of Jacob, just as He perfected it earlier on your forefathers Abraham and Isaac: your Lord is all knowing and wise.’\"",
                    "asad": "For, [as thou hast been shown in thy dream,] even thus will thy Sustainer elect thee, and will impart unto thee some understanding of the inner meaning of happenings, and will bestow the full measure of His blessings upon thee and upon the House of Jacob -even as, aforetime, He bestowed it in full measure upon thy forefathers Abraham and Isaac. Verily, thy Sustainer is all-knowing, wise!\"",
                    "sahih": "\"And thus will your Lord choose you and teach you the interpretation of narratives [i.e., events or dreams] and complete His favor upon you and upon the family of Jacob, as He completed it upon your fathers before, Abraham and Isaac. Indeed, your Lord is Knowing and Wise.\\\"\"",
                    "usmani": "\"اور اسی طرح برگزیدہ کرے گا تجھ کو تیرا رب<sup foot_note=\\\"83913\\\">1</sup> اور سکھلائے گا تجھ کو ٹھکانے پر لگانا باتوں کا<sup foot_note=\\\"83914\\\">2</sup> اور پورا کرے گا اپنا انعام تجھ پر اور یعقوب کے گھر پر<sup foot_note=\\\"83915\\\">3</sup> جیسا پورا کیا ہے تیرے دو باپ دادوں پر اس سے پہلے ابراہیم اور اسحٰق پر<sup foot_note=\\\"83916\\\">4</sup> البتہ تیرا رب خبردار ہے حکمت والا<sup foot_note=\\\"83917\\\">5</sup>\"",
                    "footnotes_sahih": "{}",
                    "footnotes_usmani": "{\"83913\":\"<strong class=h>حضرت یوسف علیہ السلام کی نبوت کی پیشگوئی:</strong>یعنی جس طرح ایسا اچھا خواب دکھلایا ، اسی طرح محض جاذبہ رحمت سے اپنی بارگاہ قرب میں تجھ کو خصوصی مقام عطاء فرمائے گا۔ چنانچہ نبوت عطاء فرمائی اور طرح طرح کی ظاہری و باطنی نوازشیں کیں۔\",\"83914\":\"<strong class=h>حضرت یوسف علیہ السلام کو تعبیر خواب کا علم:</strong>مثلاً تعبیر رؤیا ، یعنی خواب سن کر اس کے اجزا کو ذہانت و فراست سے ٹھکانے لگا دینا۔ یا ہر بات کے موقع و محل کو سمجھنا ، اور معاملات کے عواقب و نتائج کو فورًا پرکھ لینا۔ یا خدا اور پیغمبروں کے ارشادات اقوام و اممم کے قصص اور کتب منزلہ کے مضامین کی تہ تک پہنچ جانا ۔ یہ سب چیزیں \\\"تاویل الاحادیث کے تحت میں مندرج ہو سکتی ہیں\\\"،\",\"83915\":\"یعنی اخروی نعمتوں کے ساتھ دنیوی نعمتیں عطا فرمائے گا۔ نبوت کے ساتھ ! بادشاہت میں حصہ دے گا اور شدائد و محن سے نجات دے کر خوشحالی و فراغ بالی کی زندگی نصیب کرے گا۔\",\"83917\":\"یعنی وہ ہر ایک کی مناسبت و استعداد سے باخبر ہے اپنی حکمت سے اسی کے مناسب فیض پہنچاتا ہے۔\",\"83916\":\"یعقوبؑ کے گھرانے کو دنیوی مکروہات اور مادی تکلیفوں سے رہائی دے گا اور آئندہ ان کی نسل سے بڑے بڑے پیغمبر اور بادشاہ پیدا کرے گا۔ حضرت یعقوبؑ نے تواضعًا اپنا نام نہیں لیا۔ اپنے والد حضرت اسحاقؑ اور ان کے والد حضرت ابراہیمؑ کا ذکر فرمایا۔ حضرت ابراہیمؑ کو خدا نے اپنا خلیل اوعر نبی بنایا ، ان کے دشمن نمرود کا ہلاک کیا، آگ کے شعلوں کو ان کے لئے گلزار بنا دیا، حضرت اسحاقؑ کو نبوت عطا کی ، پھر ان کے سلب سے حضرت یعقوبؑ جیسا نبی پیدا کیا ۔ جس سے تمام  انبیائے بنی اسرائیل کا سلسلہ چلا۔ حدیث صحیح میں ہے ۔ \\\"الکریم ابن الکریم ابن الکریم ابن الکریم یوسف بن یعقوب بن اسحٰق بن ابراھیم\\\" (تنبیہ۹ حضرت یعقوبؑ نے جو پیشنگوئی کی اس کا کچھ حصہ تو غالبًا حضرت یوسفؑ کے خواب سے سمجھے اور اس سے کہ اتنی چھوٹی عمر میں ایسا موزوں و مبارک خواب دیکھا۔ اور کچھ حضرت یوسفؑ کے خصائل و شمائل سے یا وحی الہٰی کے ذریعہ سے مطلع ہوئے ہوں گے۔\"}"
                },
                "surah": 12,
                "ayah": 6,
                "notes": "Surah Yusuf 12:6"
            },
            {
                "unit_id": "U:QURAN:12:7",
                "unit_type": "ayah",
                "arabic": "لقد كان في يوسف وإخوته آيات للسائلين",
                "arabic_diacritics": "۞ لَّقَدۡ كَانَ فِي يُوسُفَ وَإِخۡوَتِهِۦٓ ءَايَٰتٞ لِّلسَّآئِلِينَ ٧",
                "arabic_non_diacritics": "لقد كان في يوسف وإخوته آيات للسائلين",
                "translation": "\"There are lessons in the story of Joseph and his brothers for all who seek them.\"",
                "translations": {
                    "haleem": "\"There are lessons in the story of Joseph and his brothers for all who seek them.\"",
                    "asad": "Indeed, in [the story of] Joseph and his brothers there are messages for all who search [after truth].",
                    "sahih": "\"Certainly were there in Joseph and his brothers signs for those who ask, [such as]\"",
                    "usmani": "\"البتہ ہیں یوسف کے قصہ میں اور اس کے بھائیوں کے قصہ میں نشانیاں پوچھنے والوں کے لئے<sup foot_note=\\\"83918\\\">1</sup>\"",
                    "footnotes_sahih": "{}",
                    "footnotes_usmani": "{\"83918\":\"<strong class=h>قصہ یوسف علیہ السلام میں نشانیاں ہیں:</strong>یعنی جو لوگ اس طرح کے واقعات دریافت کر کے کسی نتیجہ پر پہنچنا چاہتے ہیں ان کے لئے یوسفؑ اور ان کے بھائیوں کی سرگذشت میں ہدیات و عبرت کی بہت سے نشانیاں موجود ہیں۔ اس قسہ کو سن کو قلوب میں حق تعالیٰ کی عظیم قدرت و حکمت کا نقش جم جاتا ہے۔ نبی کریم ﷺ کی صداقت کا بین ثبوت ملتا ہے کہ آپ باوجود امّی ہونے اور کسی کتاب یا معلم سے استفادہ نہ کرنے کے ایسے منقح و منضبط تاریخی حقائق کا انکشاف فرما رہے ہیں جن کے بیان کی بجز اعلام ربانی کے کوئی توجہیہ نہیں ہو سکتی۔ خصوصًا قریش مکہ کے لئے (جو یہود کے اکسانے سے اس قصہ کے متعلق حضور ﷺ سے سوال کر رہے تھے) اس واقع میں بڑا عبرت آمقز سبق ہے کہ جس طرح حضرت یوسفؑ کو بھائیوں نے گھر سے نکالا ، زاراہ حسد قتل یا جلاسطن کرنے کے مشورے کئے ۔ طرح طرح سے ایذا۴یں پہنچا۴یں۔ اہانت و استخفاف میں کوئی دقیقہ اتھا نہ رکھا آکر ایک دن آیا کہ یوسفؑ کی طرح نادم و محتاج ہو کر آئے۔ یوسفؑ کو خدا نے دین و دنیا کے اعلیٰ مناصب پر فائز کیا اور انہوں نے اپنے عروج و اقتدار کے وقت بھائیوں کے جرائم سے چشم پوشی کی اور نہایت دریا دلی سے سب کے قصور معاف کر دیے۔ ٹھیک اسی طرح حضرت محمد رسول اللہ ﷺ کی برادری نے آپ کے متعلق ناپاک منصوبے باندھے ۔ دکھ پہنچا۴ے ، عزت و آبرو پر حملے کئے، حتٰی کہ وطن چھوڑنے پر مجبور کیا۔ لیکن جلد وہ دن آنے والا تھا جب وطن سے علیحدہ ہو کر آپ کی کامیابی اور رفعت شان کا آفتاب چمکا ، اور چند سال کے بعد فتح مکہ کا وہ تاریخی دن آ پہنچا جبکہ آپ نے اپنے قومی اور وطنی بھائیوں کی گذشتہ تقصیرات پر بعینہ حضرت یوسفؑ والے کلمات \\\"لاتثریب علیکم الیوم\\\" فرما کر قلم عفو کھینچ دیا۔\"}"
                },
                "surah": 12,
                "ayah": 7,
                "notes": "Surah Yusuf 12:7"
            }
        ],
        "sentences": [
            {
                "sentence_occ_id": "d4c3b2a1f0e9d8c7b6a5e4f3e2d1c0b9a8f7e6d5c4b3a2918273645544332211",
                "u_sentence_id": "e1ca0cc1ab9517de4779821dd3ccea32150e21555218c8f8d65ae9683ac39ee6",
                "unit_id": "U:QURAN:12:1-7",
                "sentence_order": 1,
                "text": {
                    "arabic": "تلك آيات الكتاب المبين",
                    "translation": null
                },
                "notes": "جملة تبيانية في مقدم سورة يوسف، تربط مقدمة القصّة بالأدلة التي في الكتاب المبين.",
                "ref": {
                    "unit_id": "U:QURAN:12:1-7"
                },
                "anchors": {},
                "sentence_kind": "nominal",
                "sequence": {
                    "type": "sentence",
                    "tokens": [
                        {
                            "i": 0,
                            "t": "تلك",
                            "ar_u_token": "8183b7eef00a3a5b4cf7ed06ce1f07475f8e13304ce71a08561be8275d2a8bbd"
                        },
                        {
                            "i": 1,
                            "t": "آيات",
                            "ar_u_token": "f2472641be2db5f96790e875bea5baf30d792ce09e243b085e1b52b5bd489b25"
                        },
                        {
                            "i": 2,
                            "t": "الكتاب",
                            "ar_u_token": "b98ad0dae49a259a44ba3d5ae6b82d30ecd3f1062129db46073420fa655ab5ee"
                        },
                        {
                            "i": 3,
                            "t": "المبين",
                            "ar_u_token": "a2b373a52f4dce19b753557816b9eaa62dc5c0bd16e049b2e83631e5cdcf8937"
                        }
                    ],
                    "spans": [
                        {
                            "id": "S1",
                            "text": "آيات الكتاب",
                            "ar_u_span": "b51931fa62b72eb03a7f5efd652966f5c4cccf69ab50362420e0504227914e6b",
                            "token_index_range": [
                                1,
                                2
                            ]
                        },
                        {
                            "id": "S2",
                            "text": "الكتاب المبين",
                            "ar_u_span": "2ee76212e6d4e5a90c3dc4fb983b16e48d4655bd6fcded3d5d10d73bf1776c79",
                            "token_index_range": [
                                2,
                                3
                            ]
                        }
                    ]
                },
                "created_at": "2026-02-02 05:55:03",
                "updated_at": null
            },
            {
                "sentence_occ_id": "91f0cde8b7a6d5c4e3f2a1b09876543210fedcba9876543210abcd",
                "u_sentence_id": "6a91d5f7e4c2b3a9f8e1d0c7b6a5e4d3c2b1a0f9e8d7c6b5a4e3d2",
                "unit_id": "U:QURAN:12:1",
                "sentence_order": 1,
                "text": {
                    "arabic": "هذه الر",
                    "translation": null
                },
                "notes": "جملة اسمية تامّة على تقدير محذوف (حذف معتبر عند النحاة).",
                "ref": {
                    "unit_id": "U:QURAN:12:1"
                },
                "anchors": {},
                "sentence_kind": "nominal_ellipsis",
                "sequence": {
                    "type": "sentence",
                    "tokens": [
                        {
                            "i": 0,
                            "t": "هذه",
                            "ar_u_token": null
                        },
                        {
                            "i": 1,
                            "t": "الر",
                            "ar_u_token": null
                        }
                    ],
                    "analysis": {
                        "kind": "nominal_ellipsis",
                        "ellipsis": 1
                    }
                },
                "created_at": "2026-02-02 05:39:34",
                "updated_at": null
            }
        ],
        "tokens": [
            {
                "token_occ_id": "42d3e68af6526699a0a2f6bf48afc1297cb85d767df4c1610ff212739b082f09",
                "u_token_id": "8183b7eef00a3a5b4cf7ed06ce1f07475f8e13304ce71a08561be8275d2a8bbd",
                "u_root_id": null,
                "container_id": "C:QURAN",
                "unit_id": "U:QURAN:12:1",
                "pos_index": 0,
                "surface_ar": "تلك",
                "norm_ar": "تلك",
                "lemma_ar": "تلك",
                "pos": "noun",
                "features": {
                    "lang": "ar",
                    "kind": "surface"
                }
            },
            {
                "token_occ_id": "f13da95d74f0ee1099ab98fa0f149cf35b2e53858f3b03f05341b2149e5f01f1",
                "u_token_id": "f2472641be2db5f96790e875bea5baf30d792ce09e243b085e1b52b5bd489b25",
                "u_root_id": null,
                "container_id": "C:QURAN",
                "unit_id": "U:QURAN:12:1",
                "pos_index": 1,
                "surface_ar": "آيات",
                "norm_ar": "آيات",
                "lemma_ar": "آيات",
                "pos": "noun",
                "features": {
                    "lang": "ar",
                    "kind": "surface"
                }
            },
            {
                "token_occ_id": "ca3d9370728faa9e9d055b35f0f891609c4e38d1f8810706a28f9e7b0377d1a5",
                "u_token_id": "b98ad0dae49a259a44ba3d5ae6b82d30ecd3f1062129db46073420fa655ab5ee",
                "u_root_id": null,
                "container_id": "C:QURAN",
                "unit_id": "U:QURAN:12:1",
                "pos_index": 2,
                "surface_ar": "الكتاب",
                "norm_ar": "الكتاب",
                "lemma_ar": "الكتاب",
                "pos": "noun",
                "features": {
                    "lang": "ar",
                    "kind": "surface"
                }
            },
            {
                "token_occ_id": "526a4bbdd628f39eca1094b567749157afd23a860f8c5de536f4b40302542afa",
                "u_token_id": "a2b373a52f4dce19b753557816b9eaa62dc5c0bd16e049b2e83631e5cdcf8937",
                "u_root_id": null,
                "container_id": "C:QURAN",
                "unit_id": "U:QURAN:12:1",
                "pos_index": 3,
                "surface_ar": "المبين",
                "norm_ar": "المبين",
                "lemma_ar": "المبين",
                "pos": "noun",
                "features": {
                    "lang": "ar",
                    "kind": "surface"
                }
            }
        ],
        "spans": [
            {
                "span_occ_id": "00f1cecfe2c8ea785f4bc9d2ac5d30a277ee254ebcd083bb456cb43cf555939e",
                "u_span_id": "b51931fa62b72eb03a7f5efd652966f5c4cccf69ab50362420e0504227914e6b",
                "container_id": "C:QURAN",
                "unit_id": "U:QURAN:12:1",
                "start_index": 1,
                "end_index": 2,
                "text_cache": "آيات الكتاب",
                "span_type": "phrase",
                "span_kind": "idafa",
                "token_ids": [
                    "f2472641be2db5f96790e875bea5baf30d792ce09e243b085e1b52b5bd489b25",
                    "b98ad0dae49a259a44ba3d5ae6b82d30ecd3f1062129db46073420fa655ab5ee"
                ],
                "meta": {
                    "lang": "ar",
                    "kind": "np",
                    "text": "آيات الكتاب",
                    "grammar": {
                        "analysis": "idafa",
                        "roles": {
                            "mudaf": "آيات",
                            "mudaf_ilayh": "الكتاب"
                        }
                    }
                }
            },
            {
                "span_occ_id": "9fb4aa63ad827b4d6db4f3f6581e7de1aafd78c1262bcb1ee97dde26b99b96e3",
                "u_span_id": "2ee76212e6d4e5a90c3dc4fb983b16e48d4655bd6fcded3d5d10d73bf1776c79",
                "container_id": "C:QURAN",
                "unit_id": "U:QURAN:12:1",
                "start_index": 2,
                "end_index": 3,
                "text_cache": "الكتاب المبين",
                "span_type": "phrase",
                "span_kind": "mawsuf_sifa",
                "token_ids": [
                    "b98ad0dae49a259a44ba3d5ae6b82d30ecd3f1062129db46073420fa655ab5ee",
                    "a2b373a52f4dce19b753557816b9eaa62dc5c0bd16e049b2e83631e5cdcf8937"
                ],
                "meta": {
                    "lang": "ar",
                    "kind": "np",
                    "text": "الكتاب المبين",
                    "grammar": {
                        "analysis": "mawsuf_sifa",
                        "roles": {
                            "mawsuf": "الكتاب",
                            "sifa": "المبين"
                        }
                    }
                }
            }
        ],
        "vocab": {
            "verbs": [],
            "nouns": [
                {
                    "token_occ_id": "42d3e68af6526699a0a2f6bf48afc1297cb85d767df4c1610ff212739b082f09",
                    "u_token_id": "8183b7eef00a3a5b4cf7ed06ce1f07475f8e13304ce71a08561be8275d2a8bbd",
                    "u_root_id": null,
                    "pos_index": 0,
                    "surface_ar": "تلك",
                    "lemma_ar": "تلك",
                    "features": {
                        "lang": "ar",
                        "kind": "surface"
                    }
                },
                {
                    "token_occ_id": "f13da95d74f0ee1099ab98fa0f149cf35b2e53858f3b03f05341b2149e5f01f1",
                    "u_token_id": "f2472641be2db5f96790e875bea5baf30d792ce09e243b085e1b52b5bd489b25",
                    "u_root_id": null,
                    "pos_index": 1,
                    "surface_ar": "آيات",
                    "lemma_ar": "آيات",
                    "features": {
                        "lang": "ar",
                        "kind": "surface"
                    }
                },
                {
                    "token_occ_id": "ca3d9370728faa9e9d055b35f0f891609c4e38d1f8810706a28f9e7b0377d1a5",
                    "u_token_id": "b98ad0dae49a259a44ba3d5ae6b82d30ecd3f1062129db46073420fa655ab5ee",
                    "u_root_id": null,
                    "pos_index": 2,
                    "surface_ar": "الكتاب",
                    "lemma_ar": "الكتاب",
                    "features": {
                        "lang": "ar",
                        "kind": "surface"
                    }
                },
                {
                    "token_occ_id": "526a4bbdd628f39eca1094b567749157afd23a860f8c5de536f4b40302542afa",
                    "u_token_id": "a2b373a52f4dce19b753557816b9eaa62dc5c0bd16e049b2e83631e5cdcf8937",
                    "u_root_id": null,
                    "pos_index": 3,
                    "surface_ar": "المبين",
                    "lemma_ar": "المبين",
                    "features": {
                        "lang": "ar",
                        "kind": "surface"
                    }
                }
            ],
            "spans": [
                {
                    "kind": "idafa",
                    "text": "آيات الكتاب",
                    "u_span_id": "b51931fa62b72eb03a7f5efd652966f5c4cccf69ab50362420e0504227914e6b",
                    "token_u_ids": [
                        "f2472641be2db5f96790e875bea5baf30d792ce09e243b085e1b52b5bd489b25",
                        "b98ad0dae49a259a44ba3d5ae6b82d30ecd3f1062129db46073420fa655ab5ee"
                    ],
                    "meta": {
                        "lang": "ar",
                        "kind": "np",
                        "text": "آيات الكتاب",
                        "grammar": {
                            "analysis": "idafa",
                            "roles": {
                                "mudaf": "آيات",
                                "mudaf_ilayh": "الكتاب"
                            }
                        }
                    }
                },
                {
                    "kind": "mawsuf_sifa",
                    "text": "الكتاب المبين",
                    "u_span_id": "2ee76212e6d4e5a90c3dc4fb983b16e48d4655bd6fcded3d5d10d73bf1776c79",
                    "token_u_ids": [
                        "b98ad0dae49a259a44ba3d5ae6b82d30ecd3f1062129db46073420fa655ab5ee",
                        "a2b373a52f4dce19b753557816b9eaa62dc5c0bd16e049b2e83631e5cdcf8937"
                    ],
                    "meta": {
                        "lang": "ar",
                        "kind": "np",
                        "text": "الكتاب المبين",
                        "grammar": {
                            "analysis": "mawsuf_sifa",
                            "roles": {
                                "mawsuf": "الكتاب",
                                "sifa": "المبين"
                            }
                        }
                    }
                }
            ]
        },
        "lesson_json": {
            "schema_version": 1,
            "container_id": "C:QURAN",
            "unit_id": "U:QURAN:12:1-7",
            "steps": [
                {
                    "id": "read",
                    "label": "Reading"
                },
                {
                    "id": "sentences",
                    "label": "Sentence Structure"
                },
                {
                    "id": "vocab",
                    "label": "Vocabulary"
                },
                {
                    "id": "grammar",
                    "label": "Grammar: Concepts"
                },
                {
                    "id": "translations",
                    "label": "Translations"
                },
                {
                    "id": "notes",
                    "label": "Notes"
                }
            ],
            "layers": [],
            "policies": [
                {
                    "id": "canonical_text_lock",
                    "rule": "Arabic text must match canonical container units exactly."
                },
                {
                    "id": "tokenization_prefix_split",
                    "rule": "Split prefixes (و/ف/ب/ك/ل/س) into token.prefixes[] and keep surface_ar without them."
                },
                {
                    "id": "grammar_external",
                    "rule": "Grammar concepts live in separate tables; lesson stores references only."
                }
            ],
            "notes": []
        }
    }
}